---
kind: method
id: M:Autodesk.Revit.DB.TriangulationInterfaceForTriangulatedSolidOrShell.#ctor(Autodesk.Revit.DB.TriangulatedSolidOrShell)
source: html/0183fbc8-6ac0-f0cd-c426-4751ec878387.htm
---
# Autodesk.Revit.DB.TriangulationInterfaceForTriangulatedSolidOrShell.#ctor Method

Construct an interface object for a TriangulatedSolidOrShell.

## Syntax (C#)
```csharp
public TriangulationInterfaceForTriangulatedSolidOrShell(
	TriangulatedSolidOrShell externalTriangulatedSolidOrShell
)
```

## Parameters
- **externalTriangulatedSolidOrShell** (`Autodesk.Revit.DB.TriangulatedSolidOrShell`) - The TriangulatedSolidOrShell that the interface object represents.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null